package ensyu;

public class Q03 {

	public static void main(String[] args) {
		/*----------------------------------------------------------------------------
		Q3
		xに10を代入し、それに５を３回足し結果を出力せよ。(whileと+=を使うこと)

		[実行例]
		Ans:25
		----------------------------------------------------------------------------*/
		int x = 10;
		// ループ用の変数を作る
		int i = 0;
		//while(条件式)
		while (i < 3) {
			//繰り返して実行したい処理を書く
			x += 5;
			//ループ用の変数インクリメント
			i++;
		}
		System.out.println(x);
	}
}
