package ensyu14_27;

public class Q27 {

	public static void main(String[] args) {
		/*
		 * 実行例のような描画をせよ。
		 * [実行例]
		 * ★
		 * ★★
		 * ★★★
		 */

		//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
		//パターン１

		for(int i = 0;i < 3; i++){
			for(int j = 0; j < 3; j++){
				//もし1行目の時は1回表示
				//つまりi行目の時は（i>=j）の条件で表示する
				if(i >= j){
					System.out.print("★");
				}
			}
			System.out.println("");
		}

		//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

		//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
		//パターン２

		for(int i = 0; i < 3; i++){
			for(int j = 0; j < i + 1 ; j++){
				System.out.print("★");
			}
			System.out.println("");
		}
		
		//■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

	}

}
